app/controllers/codes_controller.rb

  def search
    @codes = Code.where(nil)
    filtering_params(params).each do |key, value|
      @codes = @codes.public_send(key, value) if value.present?
---
SELECT "codes".* FROM "codes"

  def show
    @code = Code.find(params[:id])
---
SELECT  "codes".* FROM "codes" WHERE "codes"."id" = ? LIMIT 1  [["id", 8]]