app/controllers/codes_controller.rb

SELECT "codes".* FROM "codes"
---
  def index
    @code = Code.all

SELECT "codes".* FROM "codes" WHERE (language='python' AND difficulty='easy' AND title LIKE '%asdasd%')
---
  def search
    if params[:keyword].present? && params[:language].present?
      @code = Code.where("language=? AND name LIKE ?",params[:language],"%#{params[:keyword]}%")

INSERT INTO "codes" ("name", "language", "difficulty", "github_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "hey"], ["language", "python"], ["difficulty", "easy"], ["github_link", "ghkhk"], ["created_at", "2016-07-02 19:19:23.801255"], ["updated_at", "2016-07-02 19:19:23.801255"]]
---
  def create
    @code = Code.new(code_params)
    if @code.save