app/controllers/tokens_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "krizna"]]
---
	def verify
		@user = User.find_by(username: params[:user][:username])