app/controllers/users_controller.rb

    def create
    	@user=User.new(user_params)
    	if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "encrypted_password", "created_at", "updated_at", "access_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)